Autodesk.Revit.DB.RevisionCloud.GetSketchCurves
Returns copies of the Curves that form this RevisionCloud.
Remarks:
Note that there is no requirement that the curves form closed loops or avoid self-intersections.  The
curves may also form multiple closed loops.
Returns:
Copies of the sketched curves that form this RevisionCloud.
Since:
2015

Autodesk.Revit.DB.RevisionCloud.GetSheetIds
Returns the ids of the ViewSheets where this RevisionCloud may appear and contribute to the sheet's revision schedule.
Remarks:
A RevisionCloud can appear on a ViewSheet because it is drawn directly on the ViewSheet
or because its owner view is placed on the ViewSheet.  If the RevisionCloud is owned by
a view that is a dependent view or has associated dependent views, then the RevisionCloud can also
be visible on the sheets where the related dependent or primary views have been placed.
This RevisionCloud may not be visible in all ViewSheets reported by this method.
Additional factors, such as the visibility settings or annotation crop of the Views or the visibility settings
of the associated Revision may still cause this RevisionCloud to not appear on a particular ViewSheet.If this RevisionCloud is owned by a ViewLegend, no sheets will be returned because the RevisionCloud
will not participate in revision schedules.
Returns:
The ids of the ViewSheets where this RevisionCloud may appear.
Since:
2015

Autodesk.Revit.DB.RevisionCloud.IsRevisionIssued
Indicates whether the Revision associated with this RevisionCloud has been issued.
Returns:
True if the Revision has been issued, False otherwise.
Since:
2015

Autodesk.Revit.DB.RevisionCloud.Create(Autodesk.Revit.DB.Document,Autodesk.Revit.DB.View,Autodesk.Revit.DB.ElementId,System.Collections.Generic.IList{Autodesk.Revit.DB.Curve})
Creates a new RevisionCloud in the model.
Remarks:
Creates a new RevisionCloud in the specified View.  The new RevisionCloud will be associated with the specified Revision.
RevisionClouds can only be created if the Revision has not yet been issued.
RevisionClouds can be created in most graphical Views, excepting 3D views and graphical column schedules.  Unlike
most other Elements, RevisionClouds can be created directly on a ViewSheet.RevisionClouds are created based on a series of sketched curves.  There is no requirement that the curves form
closed loops and self-intersections are also permitted.  The curves will be automatically projected onto the appropriate
plane for the View.  The list of curves cannot be empty and any lines cannot be perpendicular to the View's plane.
If the View is a model View, the coordinates specified for the curves will be interpreted in model space.  If the View
is a non-model View (such as a ViewSheet) then the coordinates will be interpreted in the View's space.The cloud graphics will be attached to the curves under the assumption that each curve is oriented in a clockwise direction.
For lines, this means that the outside of the cloud is in the direction of the line's normal vector within the View's plane.  Any closed loops should
therefore be oriented clockwise to create the typical cloud shape.
document:
The document in which the RevisionCloud should be created.
view:
The View in which the RevisionCloud should appear.
revisionId:
The Revision to associate with the new RevisionCloud.
curves:
The curves that will form the RevisionCloud's sketch.
Returns:
The newly created RevisionCloud.
Throws Autodesk.Revit.Exceptions.ArgumentException:
document is not a project document.
-or-
revisionId is not a valid Revision.
-or-
This operation cannot be performed because revisionId is an issued Revision.
-or-
view is not a View that can support RevisionClouds.
-or-
The provided Curves curves cannot be used as the basis for a RevisionCloud.  Either the list is empty or
one or more of the Curves could not be projected onto the View's plane.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2015

Autodesk.Revit.DB.RevisionCloud.RevisionId
The Revision associated with this RevisionCloud.
Remarks:
This property cannot be set to a Revision that has already been issued.  If this RevisionCloud is already associated
with a Revision that has been issued then this property cannot be changed.
Throws Autodesk.Revit.Exceptions.ArgumentException:
When setting this property: revisionId is not a valid Revision.
-or-
When setting this property: This operation cannot be performed because revisionId is an issued Revision.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
When setting this property: A non-optional argument was NULL
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
When setting this property: This operation cannot be performed on a RevisionCloud associated with a Revision that has been issued.
Since:
2015

Autodesk.Revit.DB.RevisionCloud
A RevisionCloud is a graphical "cloud" that can be displayed on a view or sheet to indicate where revisions in the model have occurred.
Remarks:
RevisionClouds are view specific and can be created in most graphical views, except 3D.  Unlike most Elements, RevisionClouds may be added
directly to a ViewSheet.  Each RevisionCloud is associated with one Revision.
When a RevisionCloud is visible on a
ViewSheet (either because it is directly placed on that ViewSheet or because it is visible in a View placed on the ViewSheet),
any revision schedules displayed on the ViewSheet will automatically include the Revision associated with the RevisionCloud.Note also that when a RevisionCloud is created in a ViewLegend, it is treated as a legend representation of what a RevisionCloud
looks like rather than as an actual indication of a change to the model.  As a result, RevisionClouds in ViewLegends will not affect the contents
of revision schedules.RevisionClouds are created from a collection of sketched curves.  Each curve will have a series of "cloud bumps" drawn
along it to form the appearance of a cloud.  There is no requirement that the curves form closed loops.
Since:
2015